app/Http/Livewire/Procurement/Requests/Procurement/ProcurementBidManagementComponent.php

    public function updateRequest(ProcurementRequest $procurementRequest,$status)
    {
        $this->validate([
            'comment'=>'required|string',
        ]);

        if ($procurementRequest->step_order==6) {

            DB::transaction(function () use($procurementRequest,$status) {
                $procurementRequestApproval=ProcurementRequestApproval::where(['procurement_request_id'=>$procurementRequest->id,'step'=>ProcurementRequestEnum::step($procurementRequest->step_order)])->latest()->first();

                if($procurementRequest->step_order < ProcurementRequestEnum::TOTAL_STEPS){
                    $procurementRequestApproval->update([
                        'approver_id' => auth()->user()->id,
                        'comment' => $this->comment,
                        'status' => $status,
                    ]);

                    $currentStepOrder = $procurementRequest->step_order;
                    $nextStepOrder = $currentStepOrder+1;

                    $procurementRequest->update([
                        'status'=>ProcurementRequestEnum::PENDING,
                        'step_order'=>$nextStepOrder,
                    ]);

                    ProcurementRequestApproval::create([
                        'procurement_request_id' => $procurementRequest->id,
                        'approver_id' => null,
                        'comment' => null,
                        'status' => ProcurementRequestEnum::PENDING,
                        'step' => ProcurementRequestEnum::step($nextStepOrder),
                    ]);
---
select * from `procurement_request_approvals` where (`procurement_request_id` = 7 and `step` = 'Procurement') order by `created_at` desc limit 1
update `procurement_requests` set `step_order` = 7, `status` = 'Pending', `procurement_requests`.`updated_at` = '2024-01-30 13:01:40' where `id` = 7
insert into `procurement_request_approvals` (`procurement_request_id`, `approver_id`, `comment`, `status`, `step`, `updated_at`, `created_at`) values (7, '', '', 'Pending', 'Stores', '2024-01-30 13:01:40', '2024-01-30 13:01:40')

            });

            if ($status==ProcurementRequestEnum::PROCESSED) {
                $users= User::whereHas('employee', function($query){
                    $query->where('department_id',auth()->user()->employee->department_id);
                })->get();
---
select * from `employees` where `employees`.`id` = 1 limit 1
select * from `users` where exists (select * from `employees` where `users`.`employee_id` = `employees`.`id` and `department_id` = 3)

    public function initiatePaymentRequest()
    {
        $this->validate([
            'net_payment'=>'required|numeric|gt:0|lte:'.(100-$this->procurementRequest?->payment_requests?->sum('net_payment_terms')),
            'payment_description'=>'required|string',
        ]);

        $requestable = null;
        $department_id = null;
        $project_id = null;
        $ledger_account = null;
        $currency_id = $this->procurementRequest->currency_id;
        $budget_line_id = $this->procurementRequest->budget_line_id;

        if ($this->procurementRequest->request_type == 'Project') {
            $department_id = null;
            $requestable = Project::with('ledger')->find($this->procurementRequest->requestable_id);
            $ledger_account = $requestable->ledger->id;

        } elseif ($this->procurementRequest->request_type == 'Department') {
            $project_id = null;
            $requestable = Department::with('ledger')->find($this->procurementRequest->requestable_id);
---
select * from `departments` where `departments`.`id` = 3 limit 1

            $paymentRequestService= new FmsPaymentRequestService();
            // Call the service to create the payment request
            $saveData = $paymentRequestService->createPaymentRequest($requestData);
            $this->procurementRequest->update([
                'net_payment_terms'=>$this->procurementRequest->net_payment_terms+$this->net_payment,
            ]);
---
update `procurement_requests` set `net_payment_terms` = 60, `procurement_requests`.`updated_at` = '2024-01-30 12:56:55' where `id` = 7

    public function render()
    {
        $data['request'] = ProcurementRequest::with('items','documents','requester','approvals','approvals.approver','decisions','procurement_method','providers','payment_requests')->findOrFail($this->request_id);
        $data['document_categories'] = DmCategory::all();
---
select * from `fms_payment_requests` where `fms_payment_requests`.`procurement_request_id` in (7)
select * from `procurement_methods` where `procurement_methods`.`id` in (6)
select * from `procurement_requests` where `procurement_requests`.`id` = '7' limit 1
select `providers`.*, `selected_providers`.`procurement_request_id` as `pivot_procurement_request_id`, `selected_providers`.`provider_id` as `pivot_provider_id`, `selected_providers`.`is_best_bidder` as `pivot_is_best_bidder`, `selected_providers`.`invoice_no` as `pivot_invoice_no`, `selected_providers`.`invoice_date` as `pivot_invoice_date`, `selected_providers`.`payment_status` as `pivot_payment_status`, `selected_providers`.`date_paid` as `pivot_date_paid`, `selected_providers`.`quality_rating` as `pivot_quality_rating`, `selected_providers`.`timeliness_rating` as `pivot_timeliness_rating`, `selected_providers`.`cost_rating` as `pivot_cost_rating`, `selected_providers`.`average_rating` as `pivot_average_rating`, `selected_providers`.`contracts_manager_comment` as `pivot_contracts_manager_comment`, `selected_providers`.`created_by` as `pivot_created_by`, `selected_providers`.`created_at` as `pivot_created_at`, `selected_providers`.`updated_at` as `pivot_updated_at` from `providers` inner join `selected_providers` on `providers`.`id` = `selected_providers`.`provider_id` where `selected_providers`.`procurement_request_id` in (7)
select * from `dm_categories`