app/Http/Livewire/Procurement/Requests/Finance/FinanceRequestViewComponent.php

    public function approveAndFowardRequest(ProcurementRequest $procurementRequest,$status)
    {
        // dd('yes');
        $this->validate([
            'comment'=>'required|string',
        ]);

        if ($procurementRequest->step_order==3) {
            DB::transaction(function () use($procurementRequest,$status) {
                $procurementRequestApproval=ProcurementRequestApproval::where(['procurement_request_id'=>$procurementRequest->id,'step'=>ProcurementRequestEnum::step($procurementRequest->step_order)])->latest()->first();

                if($procurementRequest->step_order < ProcurementRequestEnum::TOTAL_STEPS){
                    $procurementRequestApproval->update([
                        'approver_id' => auth()->user()->id,
                        'comment' => $this->comment,
                        'status' => $status,
                    ]);

                    if ($status!=ProcurementRequestEnum::REJECTED) {
                        $currentStepOrder = $procurementRequest->step_order;
                        $nextStepOrder = $currentStepOrder+1;

                        $procurementRequest->update([
                            'status'=>ProcurementRequestEnum::PENDING,
                            'step_order'=>$nextStepOrder,
                        ]);

                        ProcurementRequestApproval::create([
                            'procurement_request_id' => $procurementRequest->id,
                            'approver_id' => null,
                            'comment' => null,
                            'status' => ProcurementRequestEnum::PENDING,
                            'step' => ProcurementRequestEnum::step($nextStepOrder),
                        ]);
---
select * from `procurement_request_approvals` where (`procurement_request_id` = 7 and `step` = 'Finance') order by `created_at` desc limit 1
update `procurement_request_approvals` set `approver_id` = 1, `comment` = 'Currently, Ugandan healthcare data often resides in isolated systems, hindering collaboration and knowledge sharing. Data exchange relies on manual methods, prone to errors and delays, hampering clinical research efficiency and patient care. ', `status` = 'Approved', `procurement_request_approvals`.`updated_at` = '2024-01-30 12:22:38' where `id` = 26
insert into `procurement_request_approvals` (`procurement_request_id`, `approver_id`, `comment`, `status`, `step`, `updated_at`, `created_at`) values (7, '', '', 'Pending', 'Operations', '2024-01-30 12:22:38', '2024-01-30 12:22:38')

            });

            if ($status!=ProcurementRequestEnum::REJECTED) {
                $users= User::whereHas('employee', function($query){
                    $query->where('department_id',auth()->user()->employee->department_id);
                })->get();
---
select * from `employees` where `employees`.`id` = 1 limit 1
select * from `users` where exists (select * from `employees` where `users`.`employee_id` = `employees`.`id` and `department_id` = 3)

    public function render()
    {
        $data['request'] = ProcurementRequest::with('items','documents','requester','approvals','approvals.approver','decisions','procurement_method','providers')->findOrFail($this->request_id);
---
select * from `procurement_requests` where `procurement_requests`.`id` = '7' limit 1
select `providers`.*, `selected_providers`.`procurement_request_id` as `pivot_procurement_request_id`, `selected_providers`.`provider_id` as `pivot_provider_id`, `selected_providers`.`is_best_bidder` as `pivot_is_best_bidder`, `selected_providers`.`invoice_no` as `pivot_invoice_no`, `selected_providers`.`invoice_date` as `pivot_invoice_date`, `selected_providers`.`payment_status` as `pivot_payment_status`, `selected_providers`.`date_paid` as `pivot_date_paid`, `selected_providers`.`quality_rating` as `pivot_quality_rating`, `selected_providers`.`timeliness_rating` as `pivot_timeliness_rating`, `selected_providers`.`cost_rating` as `pivot_cost_rating`, `selected_providers`.`average_rating` as `pivot_average_rating`, `selected_providers`.`contracts_manager_comment` as `pivot_contracts_manager_comment`, `selected_providers`.`created_by` as `pivot_created_by`, `selected_providers`.`created_at` as `pivot_created_at`, `selected_providers`.`updated_at` as `pivot_updated_at` from `providers` inner join `selected_providers` on `providers`.`id` = `selected_providers`.`provider_id` where `selected_providers`.`procurement_request_id` in (7)