app/Services/Procurement/Requests/ProcurementRequestService.php

    public function createProcurementRequest(Model $model,ProcurementRequestData $procurementRequestDTO):ProcurementRequest
    {
        $document = $model->procurementRequests()->create([
            ...$this->fillProcurementRequestFromDTO($procurementRequestDTO)
        ]);
---
insert into `procurement_requests` (`request_type`, `subject`, `body`, `procuring_entity_code`, `procurement_sector`, `subcategory_id`, `financial_year_id`, `currency_id`, `budget_line_id`, `procurement_plan_ref`, `location_of_delivery`, `date_required`, `requestable_id`, `requestable_type`, `created_by`, `reference_no`, `sequence_number`, `updated_at`, `created_at`) values ('Department', 'Request to Procure computers for it dept', 'Currently, Ugandan healthcare data often resides in isolated systems, hindering collaboration and knowledge sharing. Data exchange relies on manual methods, prone to errors and delays, hampering clinical research efficiency and patient care. ', 'MAKBRC', 'Supplies', '26', '1', 2, '6', 'PROC334445', 'Mulago', '2024-01-30', 3, 'App\Models\HumanResource\Settings\Department', 1, '24SUP-0028', '24SUP-002I', '2024-01-30 12:18:29', '2024-01-30 12:18:29')