app/Http/Livewire/Procurement/Settings/Inc/ProviderDocumentsComponent.php

    public function render()
    {
        $data['providers'] = Provider::where('is_active',true)->get();
        $data['document_categories'] = DmCategory::all();
---
select * from `providers` where `is_active` = 1
select * from `dm_categories`