app/Http/Livewire/Procurement/Settings/Inc/ProviderSectorsComponent.php

    public function filterSubcategories()
    {
        $subcategories = ProcurementSubcategory::where('is_active',true)
            ->when($this->category != '', function ($query) {
                $query->where('category', $this->category);
            }, function ($query) {
                return $query;
            })->get();
---
select * from `proc_subcategories` where `is_active` = 1

    public function render()
    {
        $data['providers'] = Provider::where('is_active',true)->get();
---
select * from `providers` where `is_active` = 1