app/Http/Livewire/Procurement/Requests/ProcurementRequestDetailsComponent.php

    public function forwardToSupervisor(ProcurementRequest $procurementRequest)
    {

        if ($procurementRequest->step_order==1) {

            $this->validate([
                'comment'=>'required|string',
            ]);

            DB::transaction(function () use($procurementRequest) {
                $nextStepOrder = $procurementRequest->step_order+1;

                $procurementRequest->update([
                    'status'=>ProcurementRequestEnum::PENDING,
                    'step_order'=>$nextStepOrder,
                    'procurement_categorization_id'=>getProcurementCategorization(exchangeToDefaultCurrency($procurementRequest->currency_id, $procurementRequest->contract_value))->id,
                ]);

                ProcurementRequestApproval::create([
                    'procurement_request_id' => $procurementRequest->id,
                    'approver_id' => auth()->user()->id,
                    'comment' => $this->comment,
                    'status' => ProcurementRequestEnum::SUBMITTED,
                    'step' => ProcurementRequestEnum::step($nextStepOrder-1),
                ]);

                ProcurementRequestApproval::create([
                    'procurement_request_id' => $procurementRequest->id,
                    'approver_id' => null,
                    'comment' => null,
                    'status' => ProcurementRequestEnum::PENDING,
                    'step' => ProcurementRequestEnum::step($nextStepOrder),
                ]);
---
update `procurement_requests` set `procurement_categorization_id` = 4, `step_order` = 2, `status` = 'Pending', `procurement_requests`.`updated_at` = '2024-01-30 12:20:11' where `id` = 7
insert into `procurement_request_approvals` (`procurement_request_id`, `approver_id`, `comment`, `status`, `step`, `updated_at`, `created_at`) values (7, 1, 'Currently, Ugandan healthcare data often resides in isolated systems, hindering collaboration and knowledge sharing. Data exchange relies on manual methods, prone to errors and delays, hampering clinical research efficiency and patient care. ', 'Submitted', 'Department', '2024-01-30 12:20:11', '2024-01-30 12:20:11')
insert into `procurement_request_approvals` (`procurement_request_id`, `approver_id`, `comment`, `status`, `step`, `updated_at`, `created_at`) values (7, '', '', 'Pending', 'Supervisor', '2024-01-30 12:20:11', '2024-01-30 12:20:11')

                // dd($users);

            } else {
                $users= User::whereHas('employee', function($query){
                    $query->where('department_id',auth()->user()->employee->department_id);
                })->get();
---
select * from `employees` where `employees`.`id` = 1 limit 1
select * from `users` where exists (select * from `employees` where `users`.`employee_id` = `employees`.`id` and `department_id` = 3)

    public function render()
    {
        $data['request'] = ProcurementRequest::with('items','documents','requester','approvals','approvals.approver')->findOrFail($this->request_id);
---
select * from `procurement_requests` where `procurement_requests`.`id` = '7' limit 1