app/Http/Livewire/Procurement/Requests/ProcurementRequestComponent.php

    public function filterProcurementRequests()
    {
        $procurementRequests = ProcurementRequest::search($this->search)
            ->where('created_by',auth()->user()->id)
            ->when($this->from_date != '' && $this->to_date != '', function ($query) {
                $query->whereBetween('created_at', [$this->from_date, $this->to_date]);
            }, function ($query) {
                return $query;
            });

        $this->procurementRequestIds = $procurementRequests->pluck('id')->toArray();
---
select `id` from `procurement_requests` where `created_by` = 1