app/Http/Livewire/Finance/Budget/FmsBudgetLinesComponent.php

    public function render()
    {
        $data['budget_data'] = $budgetData = FmsBudget::where('code', $this->budgetCode)->first();
        if ($budgetData) {
            $this->budgetData = $budgetData;
            $data['budget_lines'] = FmsBudgetLine::where('fms_budget_id', $data['budget_data']->id)->get();
        } else {
            $data['budget_lines'] = collect([]);
        }
        $chartOfAccts = FmsChartOfAccount::where('is_active', 1)->with(['type']);
        $data['incomes'] = $chartOfAccts->where('account_type', 4)->get();
        $data['expenses'] = FmsChartOfAccount::where('is_active', 1)->with(['type'])->where('account_type', 3)->get();
---
select * from `fms_budgets` where `code` = 'FMB23-0001W' limit 1
select * from `fms_budget_lines` where `fms_budget_id` = 1
select * from `fms_chart_of_accounts` where `is_active` = 1 and `account_type` = 4
select * from `fms_chart_of_accounts` where `is_active` = 1 and `account_type` = 3