app/Http/Livewire/HumanResource/EmployeeData/EmployeeDataComponent.php

select * from `employees` where `is_active` = 1
---
    public function render()
    {
        $employees = Employee::where('is_active',true)->get();