app/Http/Livewire/Procurement/Requests/Inc/ProcurementRequestDocumentsComponent.php

select * from `procurement_requests` where `procurement_requests`.`id` = 7 limit 1
---
    public function storeDocument()
    {
        if ($this->procurement_request_id==null) {
            $this->dispatchBrowserEvent('swal:modal', [
                'type' => 'error',
                'message' => 'Oops Not Found!',
                'text' => 'No Procurement Request has been selected for this operation!',
            ]);
            return;
        }

        $formalDocumentDTO = new FormalDocumentData();
        $this->validate($formalDocumentDTO->rules());

        DB::transaction(function (){
            $procurementRequest = ProcurementRequest::findOrFail($this->procurement_request_id);

select * from `dm_categories`
---
    public function render()
    {
        $data['document_categories'] = DmCategory::all();