app/Http/Livewire/Procurement/Requests/Inc/ProcurementRequestFormComponent.php

select * from `fms_budget_lines` where `fms_budget_lines`.`id` = '6' limit 1
select * from `fms_budgets` where `fms_budgets`.`id` in (1)
select * from `fms_currencies` where `fms_currencies`.`id` in (2)
---
    public function updatedBudgetLineId(){
        $budgetLine = FmsBudgetLine::with('budget','budget.currency')->findOrFail($this->budget_line_id);

select * from `proc_subcategories` where `category` = 'Supplies'
---
    public function updatedProcurementSector(){
        $this->subcategories = ProcurementSubcategory::where('category',$this->procurement_sector)->get();

select * from `departments` where `departments`.`id` = 3 limit 1
select * from `employees` where `employees`.`id` = 1 limit 1
---
    public function storeProcurementRequest()
    {
        $procurementRequestDTO = new ProcurementRequestData();
        $this->validate($procurementRequestDTO->rules());

        DB::transaction(function (){

            if ($this->request_type == 'Department') {
                // dd('TRUE');
                $requestableModel = Department::findOrFail(auth()->user()->employee->department->id);

select * from `fms_financial_years` where `is_budget_year` = 1
select * from `stations` where `is_active` = 1
select * from `employees` where `employees`.`id` = 1 limit 1
select * from `fms_budget_lines` where `type` = 'Expense' and exists (select * from `fms_budgets` where `fms_budget_lines`.`fms_budget_id` = `fms_budgets`.`id` and (`fiscal_year` is null and `department_id` = 3)) order by `created_at` desc
select `projects`.*, `employee_project`.`employee_id` as `pivot_employee_id`, `employee_project`.`project_id` as `pivot_project_id`, `employee_project`.`id` as `pivot_id`, `employee_project`.`designation_id` as `pivot_designation_id`, `employee_project`.`contract_summary` as `pivot_contract_summary`, `employee_project`.`start_date` as `pivot_start_date`, `employee_project`.`end_date` as `pivot_end_date`, `employee_project`.`fte` as `pivot_fte`, `employee_project`.`gross_salary` as `pivot_gross_salary`, `employee_project`.`contract_file_path` as `pivot_contract_file_path`, `employee_project`.`status` as `pivot_status`, `employee_project`.`created_at` as `pivot_created_at`, `employee_project`.`updated_at` as `pivot_updated_at` from `projects` inner join `employee_project` on `projects`.`id` = `employee_project`.`project_id` where `employee_project`.`employee_id` = 1
---
    public function render()
    {
        $data['projects'] = auth()->user()->employee->projects??Collect([]);
        $data['financial_years'] = FmsFinancialYear::where('is_budget_year',true)->get();
        $data['stations'] = Station::where('is_active',true)->get();

        $data['budget_lines'] = FmsBudgetLine::where('type','Expense')->whereHas('budget', function ($query) {
            $query->where(['fiscal_year' => $this->financial_year_id,'department_id' => auth()->user()->employee->department_id]);
        })->latest()->get();

        if ($this->project_id) {
            $data['budget_lines'] = FmsBudgetLine::where('type','Expense')->whereHas('budget', function ($query) {
                $query->where(['fiscal_year' => $this->financial_year_id,'project_id' => $this->project_id]);
            })->latest()->get();