app/Http/Livewire/Procurement/Requests/Inc/ProcurementRequestItemsComponent.php

insert into `procurement_request_items` (`procurement_request_id`, `item_name`, `description`, `quantity`, `unit_of_measure`, `estimated_unit_cost`, `total_cost`, `created_by`, `updated_at`, `created_at`) values (7, 'Desktop', 'Currently, Ugandan healthcare data often resides in isolated systems, hindering collaboration and knowledge sharing.', 1, 'Pcs', 450, 450, 1, '2024-01-30 12:19:26', '2024-01-30 12:19:26')
update `procurement_requests` set `contract_value` = `contract_value` + 450, `procurement_requests`.`updated_at` = '2024-01-30 12:19:26' where `id` = 7
---

        DB::transaction(function (){

            $procurementRequestItem = ProcurementRequestItem::create([
                'procurement_request_id' => $this->procurement_request_id,
                'item_name' => $this->item_name,
                'description' => $this->description,
                'quantity' => $this->quantity,
                'unit_of_measure' => $this->unit_of_measure,
                'estimated_unit_cost' => $this->estimated_unit_cost,
                'total_cost' => $this->total_cost,

                ]
            );

            // $this->procurementRequest=ProcurementRequest::findOrFail($this->procurement_request_id);
            $this->procurementRequest->increment('contract_value',$this->total_cost);

select * from `procurement_requests` where `procurement_requests`.`id` = 7 limit 1
---
    public function render()
    {
        if($this->procurement_request_id){

        $request = ProcurementRequest::with('items')->findOrFail($this->procurement_request_id)??null;