app/Http/Livewire/Procurement/Settings/ProcurementSubcategoriesComponent.php

    public function filterSubcategories()
    {
        $subcategories = ProcurementSubcategory::search($this->search)
            ->when($this->from_date != '' && $this->to_date != '', function ($query) {
                $query->whereBetween('created_at', [$this->from_date, $this->to_date]);
            }, function ($query) {
                return $query;
            });

        $this->subcategoryIds = $subcategories->pluck('id')->toArray();
---
select `id` from `proc_subcategories`

    public function render()
    {
        $data['subcategories'] = $this->filterSubcategories()
        ->orderBy($this->orderBy, $this->orderAsc ? 'asc' : 'desc')
        ->paginate($this->perPage);
---
select * from `proc_subcategories` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `proc_subcategories`