app/Http/Livewire/Procurement/Settings/ProvidersComponent.php

select `id` from `providers`
---
    public function filterProviders()
    {
        $providers = Provider::search($this->search)->with('procurement_requests')
            ->when($this->from_date != '' && $this->to_date != '', function ($query) {
                $query->whereBetween('created_at', [$this->from_date, $this->to_date]);
            }, function ($query) {
                return $query;
            });

        $this->providerIds = $providers->pluck('id')->toArray();

select * from `providers` order by `id` desc limit 50 offset 0
select count(*) as aggregate from `providers`
---
    public function render()
    {
        $data['providers'] = $this->filterProviders()
        ->orderBy($this->orderBy, $this->orderAsc ? 'asc' : 'desc')
        ->paginate($this->perPage);