app/Http/Livewire/Procurement/Requests/Procurement/Inc/BidderPricesComponent.php

select * from `procurement_request_items` where `procurement_request_items`.`id` = 13 limit 1
---
    public function updatedBidderUnitCost(){

        $this->bidder_total_cost = (ProcurementRequestItem::findOrFail($this->item_id)->quantity)*$this->bidder_unit_cost;

update `procurement_request_items` set `bidder_unit_cost` = 400, `bidder_total_cost` = 400, `procurement_request_items`.`updated_at` = '2024-01-30 12:39:41' where `id` = 13
---
    public function storeBidderPrice(ProcurementRequestItem $procurementRequestItem){
        $this->validate([
            'bidder_unit_cost'=>'required|numeric|gt:0',
            'bidder_total_cost'=>'required|numeric|gt:0',
        ]);

        // dd('YES');
        if($this->item_id){
            DB::transaction(function () use($procurementRequestItem) {

                $procurementRequestItem->update([
                    'bidder_unit_cost'=>$this->bidder_unit_cost,
                    'bidder_total_cost'=>$this->bidder_total_cost,
                ]);

select * from `procurement_requests` where `procurement_requests`.`id` = 7 limit 1
---
    public function render()
    {
        $this->request= ProcurementRequest::with('items')->findOrFail($this->request_id);