app/Http/Livewire/Procurement/Requests/Procurement/Inc/LpoComponent.php

    public function render()
    {
        $data['request'] = ProcurementRequest::with('items','approvals','approvals.approver','bestBidders')->findOrFail($this->request_id);
---
select * from `procurement_requests` where `procurement_requests`.`id` = '7' limit 1