app/Http/Livewire/Procurement/Requests/Procurement/Inc/RequestBiddingComponent.php

    public function mount(){
        $request = ProcurementRequest::findOrFail($this->request_id);
---
select * from `procurement_requests` where `procurement_requests`.`id` = 7 limit 1

    public function updatedProviderIds()
    {
        $this->selectedProviders = Provider::whereIn('id', $this->providerIds)->get();
---
select * from `selected_providers` where `selected_providers`.`procurement_request_id` = 7
select * from `providers` where `id` in ('1')

            ]);

           DB::transaction(function () {
                ProcurementRequestDecision::create([
                    'procurement_request_id'=>$this->request->id,
                    'decision_maker'=>ProcurementRequestEnum::PD,
                    'decision'=>ProcurementRequestEnum::APPROVED,
                    'step'=>ProcurementRequestEnum::PM_APPROVAL,
                    'comment'=>$this->comment,
                    'decision_date'=>today(),
                ]);
---
insert into `procurement_request_decisions` (`procurement_request_id`, `decision_maker`, `decision`, `step`, `comment`, `decision_date`, `updated_at`, `created_at`) values (7, 'Procurement Department', 'Approved', 'Procurement Method Approval', 'Currently, Ugandan healthcare data often resides in isolated systems, hindering collaboration and knowledge sharing. Data exchange relies on manual methods, prone to errors and delays, hampering clinical research efficiency and patient care. ', '2024-01-30 00:00:00', '2024-01-30 12:36:44', '2024-01-30 12:36:44')

            ]);

           DB::transaction(function () {
                ProcurementRequestDecision::create([
                    'procurement_request_id'=>$this->request->id,
                    'decision_maker'=>ProcurementRequestEnum::PD,
                    'decision'=>$this->decision,
                    'step'=>ProcurementRequestEnum::ER_APPROVAL,
                    'comment'=>$this->comment,
                    'decision_date'=>today(),
                ]);
---
insert into `procurement_request_decisions` (`procurement_request_id`, `decision_maker`, `decision`, `step`, `comment`, `decision_date`, `updated_at`, `created_at`) values (7, 'Procurement Department', 'Approved', 'Evaluation Report Approval', 'Approved', '2024-01-30 00:00:00', '2024-01-30 12:38:56', '2024-01-30 12:38:56')

    public function filterProviders()
    {
        $providers = Provider::search($this->search)->whereHas('procurementSubcategories', function ($query) {
            $query->where(['subcategory_id' => $this->subcategory_id]);
        })->get();
---
select * from `providers` where exists (select * from `proc_subcategories` inner join `provider_subcategory` on `proc_subcategories`.`id` = `provider_subcategory`.`subcategory_id` where `providers`.`id` = `provider_subcategory`.`provider_id` and (`subcategory_id` = 26))

    public function render()
    {
        $data['procurementMethods'] = ProcurementMethod::all();
        $data['providers'] =$this->filterProviders();
        $data['document_categories'] = DmCategory::all();
---
select * from `procurement_methods`
select * from `dm_categories`