app/Http/Livewire/Procurement/Requests/Procurement/Inc/RequestBiddingComponent.php

    public function resetInputs()
    {
        $this->reset([
        'decision',
        'decision_date',
        'procurement_method_id',
        'bid_return_deadline',
        'report',
        'report_path',
        'document_category',
        'comment',
        'best_bidder_id',
        'bidder_contract_price',
        'delivery_deadline',
        'bidder_revised_price',]);

        $this->providerIds = [];
        $this->selectedProviders = collect([]);
---
select * from `selected_providers` where `selected_providers`.`procurement_request_id` = 7