app/Http/Livewire/HumanResource/EmployeeData/Inc/GeneralInformationComponent.php

select * from `designations` where `is_active` = 1
select * from `stations` where `is_active` = 1
select * from `departments` where `is_active` = 1
select * from `employees` where `is_active` = 1
---
    public function render()
    {
        $data['designations'] = Designation::where('is_active',true)->get();
        $data['stations'] = Station::where('is_active',true)->get();
        $data['departments'] = Department::where('is_active',true)->get();
        $data['supervisors'] = Employee::where('is_active',true)->get();