app/Http/Livewire/Grants/Projects/Inc/ProjectFormComponent.php

select * from `employees` where `is_active` = 1
---
    public function render()
    {
        $data['employees'] = Employee::where('is_active',true)->get();