app/Http/Livewire/Procurement/Requests/ContractsManager/Inc/RequestManagementComponent.php

select * from `procurement_requests` where `procurement_requests`.`id` = 7 limit 1
---
    public function render()
    {
        $data['request'] = ProcurementRequest::with('bestBidders')->findOrFail($this->request_id);