app/View/Components/ReportLayout.php

    public function __construct()
    {
        $this->organizationInfo = CompanyProfile::first();
---
select * from `company_profiles` limit 1