app/Helpers/helpers.php

function getProcurementCategorization($amount)
{
    $categorization = ProcurementCategorization::latest()->get();
---
select * from `procurement_categorizations` order by `created_at` desc

function isMacroProcurement($amount)
{
    $categorization = ProcurementCategorization::latest()->get();
---
select * from `procurement_categorizations` order by `created_at` desc

function requiresProcurementContract($amount)
{
    $categorization = ProcurementCategorization::latest()->get();
---
select * from `procurement_categorizations` order by `created_at` desc

function procurementMethodApproved($procurementRequestId)
{
    $pro_decision_step=ProcurementRequestDecision::where(['procurement_request_id'=>$procurementRequestId,'step'=>ProcurementRequestEnum::PM_APPROVAL])->first();
---
select * from `procurement_request_decisions` where (`procurement_request_id` = 7 and `step` = 'Procurement Method Approval') limit 1

function checkProcurementMethodApproval($procurementRequestId)
{
    $pro_decision=ProcurementRequestDecision::where(['procurement_request_id'=>$procurementRequestId,'step'=>ProcurementRequestEnum::PM_APPROVAL])->get();
---
select * from `procurement_request_decisions` where (`procurement_request_id` = 7 and `step` = 'Procurement Method Approval')

function procurementEvaluationApproved($procurementRequestId)
{
    $pro_decision_step = ProcurementRequestDecision::where(['procurement_request_id'=>$procurementRequestId,'step'=>ProcurementRequestEnum::ER_APPROVAL])->first();
---
select * from `procurement_request_decisions` where (`procurement_request_id` = 7 and `step` = 'Evaluation Report Approval') limit 1

function checkProcurementEvaluationApproval($procurementRequestId)
{
    $pro_decision=ProcurementRequestDecision::where(['procurement_request_id'=>$procurementRequestId,'step'=>ProcurementRequestEnum::ER_APPROVAL])->get();
---
select * from `procurement_request_decisions` where (`procurement_request_id` = 7 and `step` = 'Evaluation Report Approval')

function getItemsTotalCost($procurementRequestId)
{
    $items_cost = ProcurementRequest::with('items')->findOrFail($procurementRequestId)->items()->sum('bidder_total_cost');
---
select * from `procurement_requests` where `procurement_requests`.`id` = 7 limit 1

function getCurrencies()
{
    $currencies = FmsCurrency::all();
---
select * from `fms_currencies`

function exchangeToDefaultCurrency($fmsCurrencyId, $amount = 1)
{
    $fmsCurrency=FmsCurrency::findOrFail($fmsCurrencyId);
---
select * from `fms_currencies` where `fms_currencies`.`id` = 2 limit 1

function exchangeRate($fmsCurrencyId)
{
    return FmsCurrency::findOrFail($fmsCurrencyId)->exchange_rate;
---
select * from `fms_currencies` where `fms_currencies`.`id` = 2 limit 1

function getBudgetLineBalance($fmsBudgetLineId){
    return FmsBudgetLine::findOrFail($fmsBudgetLineId)->primary_balance;
---
select * from `fms_budget_lines` where `fms_budget_lines`.`id` = 6 limit 1