app/Http/Livewire/Procurement/Requests/Operations/OperationsRequestViewComponent.php

    public function approveAndFowardRequest(ProcurementRequest $procurementRequest,$status)
    {
        // dd('yes');
        $this->validate([
            'comment'=>'required|string',
        ]);
        DB::transaction(function () use($procurementRequest,$status) {
            $procurementRequestApproval=ProcurementRequestApproval::where(['procurement_request_id'=>$procurementRequest->id,'step'=>ProcurementRequestEnum::step($procurementRequest->step_order)])->latest()->first();

            if($procurementRequest->step_order < ProcurementRequestEnum::TOTAL_STEPS){
                $procurementRequestApproval->update([
                    'approver_id' => auth()->user()->id,
                    'comment' => $this->comment,
                    'status' => $status,
                ]);

                if ($status!=ProcurementRequestEnum::REJECTED) {
                    $currentStepOrder = $procurementRequest->step_order;
                    $nextStepOrder = $currentStepOrder+1;

                    $procurementRequest->update([
                        'status'=>ProcurementRequestEnum::PENDING,
                        'step_order'=>$nextStepOrder,
                    ]);

                    ProcurementRequestApproval::create([
                        'procurement_request_id' => $procurementRequest->id,
                        'approver_id' => null,
                        'comment' => null,
                        'status' => ProcurementRequestEnum::PENDING,
                        'step' => ProcurementRequestEnum::step($nextStepOrder),
                    ]);
---
select * from `procurement_request_approvals` where (`procurement_request_id` = 7 and `step` = 'Operations') order by `created_at` desc limit 1
update `procurement_request_approvals` set `approver_id` = 1, `comment` = 'Currently, Ugandan healthcare data often resides in isolated systems, hindering collaboration and knowledge sharing. Data exchange relies on manual methods, prone to errors and delays, hampering clinical research efficiency and patient care. ', `status` = 'Approved', `procurement_request_approvals`.`updated_at` = '2024-01-30 12:23:27' where `id` = 27
insert into `procurement_request_approvals` (`procurement_request_id`, `approver_id`, `comment`, `status`, `step`, `updated_at`, `created_at`) values (7, '', '', 'Pending', 'Md', '2024-01-30 12:23:27', '2024-01-30 12:23:27')