app/Http/Livewire/Grants/Projects/ProjectComponent.php

select `projects`.*, DATEDIFF(end_date, CURRENT_DATE()) as days_to_expire from `projects`
---
    public function filterProjects()
    {
        $projects = Project::search($this->search)->with('principalInvestigator')
        ->when($this->pi != 0, function ($query){
            $query->where('pi',$this->pi);
        })
        ->when($this->project_category != '', function ($query){
            $query->where('project_category',$this->project_category);
        })
        ->when($this->project_type != '', function ($query){
            $query->where('project_type',$this->project_type);
        })
        ->when($this->progress_status != '', function ($query){
            $query->where('progress_status',$this->progress_status);
        })
            ->when($this->from_date != '' && $this->to_date != '', function ($query) {
                $query->whereBetween('created_at', [$this->from_date, $this->to_date]);
            }, function ($query) {
                return $query;
            })
            ->addSelect([
                'projects.*',
                DB::raw('DATEDIFF(end_date, CURRENT_DATE()) as days_to_expire')
            ]);

        $this->projectIds = $projects->pluck('id')->toArray();

select `projects`.*, DATEDIFF(end_date, CURRENT_DATE()) as days_to_expire from `projects` order by `id` desc limit 50 offset 0
select count(*) as aggregate from `projects`
select * from `employees` where `is_active` = 1
---
    public function render()
    {
        $data['projects'] = $this->filterProjects()
        ->orderBy($this->orderBy, $this->orderAsc ? 'asc' : 'desc')
        ->paginate($this->perPage);

        $data['employees'] = Employee::where('is_active', true)->get();