app/Http/Livewire/HumanResource/Settings/CompanyProfileComponent.php

select * from `company_profiles` limit 1
---
    public function mount()
    {
        $profile = CompanyProfile::first();