app/Http/Livewire/HumanResource/Settings/DepartmentsComponent.php

insert into `departments` (`name`, `is_active`, `description`, `supervisor`, `asst_supervisor`, `type`, `prefix`, `parent_department`, `created_by`, `updated_at`, `created_at`) values ('ioy8ofu', 1, 'io0iu', '1', '1', 'Department', '87uyu', '', 1, '2023-09-03 07:50:41', '2023-09-03 07:50:41')
---
    public function storeDepartment()
    {
        $this->validate([
            'name' => 'required|string|unique:departments',
            'is_active' => 'required|numeric',
            'description' => 'nullable|string',
            'type' => 'required|string',
            'prefix' => 'required|string|unique:departments',
            'parent_department' => 'nullable|integer',
            'supervisor' => 'nullable|integer',
            'asst_supervisor' => 'nullable|integer',

        ]);

        $department = new Department();
        $department->name = $this->name;
        $department->is_active = $this->is_active;
        $department->description = $this->description;
        $department->supervisor = $this->supervisor??null;
        $department->asst_supervisor = $this->asst_supervisor??null;
        $department->type = $this->type;
        $department->prefix = removeSymbolsAndTransform($this->prefix);
        $department->parent_department = $this->parent_department??null;
        $department->save();

select `id` from `departments`
---
    public function filterDepartments()
    {
        $departments = Department::search($this->search)
            ->when($this->from_date != '' && $this->to_date != '', function ($query) {
                $query->whereBetween('created_at', [$this->from_date, $this->to_date]);
            }, function ($query) {
                return $query;
            });

        $this->departmentIds = $departments->pluck('id')->toArray();

select * from `departments` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `departments`
select * from `departments`
select * from `employees` where `is_active` = 1
---
    public function render()
    {
        $data['departments'] = $this->filterDepartments()->With(['parent'])
            ->orderBy($this->orderBy, $this->orderAsc ? 'asc' : 'desc')
            ->paginate($this->perPage);
            $data['parent_departments'] = Department::all();
            $data['department_heads'] = Employee::where('is_active',1)->get();