app/Http/Livewire/HumanResource/Settings/StationsComponent.php

    public function filterStations()
    {
        $stations = Station::search($this->search)
            ->when($this->from_date != '' && $this->to_date != '', function ($query) {
                $query->whereBetween('created_at', [$this->from_date, $this->to_date]);
            }, function ($query) {
                return $query;
            });

        $this->stationIds = $stations->pluck('id')->toArray();
---
select `id` from `stations`

    public function render()
    {
        $data['stations'] = $this->filterStations()
            ->orderBy($this->orderBy, $this->orderAsc ? 'asc' : 'desc')
            ->paginate($this->perPage);
---
select * from `stations` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `stations`