app/Services/Document/FormalDocumentService.php

    public function createFormalDocument(Model $model,FormalDocumentData $formalDocumentDTO):FormalDocument
    {
        $document = $model->documents()->create([
            ...$this->fillFormalDocumentFromDTO($formalDocumentDTO)
        ]);
---
insert into `formal_documents` (`document_category`, `expires`, `expiry_date`, `document_name`, `document_path`, `description`, `documentable_id`, `documentable_type`, `created_by`, `updated_at`, `created_at`) values ('Procurement', 0, '', 'DN', 'procurement_request_documents/2024013013061624SUP-0028 Procurement.pdf', 'Delivery note', 7, 'App\Models\Procurement\Request\ProcurementRequest', 1, '2024-01-30 13:06:16', '2024-01-30 13:06:16')