app/Http/Livewire/Procurement/Requests/Stores/StoresRequestManagementComponent.php

select * from `users` where `users`.`id` in (1)
select * from `procurement_request_approvals` where `procurement_request_approvals`.`procurement_request_id` in (7)
---
    public function updateRequest(ProcurementRequest $procurementRequest,$status)
    {
        DB::transaction(function () use($procurementRequest,$status) {
            $procurementRequestApproval=ProcurementRequestApproval::where(['procurement_request_id'=>$procurementRequest->id,'step'=>ProcurementRequestEnum::step($procurementRequest->step_order)])->latest()->first();

            $procurementRequest->update([
                'status'=>$status,
            ]);

            $procurementRequestApproval->update([
                'approver_id' => auth()->user()->id,
                'status' => $status,
            ]);
        });