app/Http/Livewire/Procurement/Requests/Stores/StoresRequestManagementComponent.php

select * from `procurement_requests` where `procurement_requests`.`id` = '7' limit 1
---
    public function storeDocument()
    {
        if ($this->request_id==null) {
            $this->dispatchBrowserEvent('swal:modal', [
                'type' => 'error',
                'message' => 'Oops Not Found!',
                'text' => 'No Procurement Request has been selected for this operation!',
            ]);
            return;
        }

        $formalDocumentDTO = new FormalDocumentData();
        $this->validate($formalDocumentDTO->rules());

        DB::transaction(function (){
            $procurementRequest = ProcurementRequest::findOrFail($this->request_id);

select * from `procurement_methods` where `procurement_methods`.`id` in (6)
select * from `procurement_requests` where `procurement_requests`.`id` = '7' limit 1
select `providers`.*, `selected_providers`.`procurement_request_id` as `pivot_procurement_request_id`, `selected_providers`.`provider_id` as `pivot_provider_id`, `selected_providers`.`is_best_bidder` as `pivot_is_best_bidder`, `selected_providers`.`invoice_no` as `pivot_invoice_no`, `selected_providers`.`invoice_date` as `pivot_invoice_date`, `selected_providers`.`payment_status` as `pivot_payment_status`, `selected_providers`.`date_paid` as `pivot_date_paid`, `selected_providers`.`quality_rating` as `pivot_quality_rating`, `selected_providers`.`timeliness_rating` as `pivot_timeliness_rating`, `selected_providers`.`cost_rating` as `pivot_cost_rating`, `selected_providers`.`average_rating` as `pivot_average_rating`, `selected_providers`.`contracts_manager_comment` as `pivot_contracts_manager_comment`, `selected_providers`.`created_by` as `pivot_created_by`, `selected_providers`.`created_at` as `pivot_created_at`, `selected_providers`.`updated_at` as `pivot_updated_at` from `providers` inner join `selected_providers` on `providers`.`id` = `selected_providers`.`provider_id` where `selected_providers`.`procurement_request_id` in (7)
select * from `dm_categories`
---
    public function render()
    {
        $data['request'] = ProcurementRequest::with('items','documents','requester','approvals','approvals.approver','decisions','procurement_method','providers')->findOrFail($this->request_id);
        $data['document_categories'] = DmCategory::all();