app/Http/Livewire/Procurement/Requests/Stores/StoresPanelComponent.php

select `id` from `procurement_requests` where `step_order` >= 7 and `procurement_sector` = 'Supplies'
---
    public function filterProcurementRequests()
    {
        $procurementRequests = ProcurementRequest::search($this->search)
        ->where('step_order','>=',7)->where('procurement_sector','Supplies')
            ->when($this->from_date != '' && $this->to_date != '', function ($query) {
                $query->whereBetween('created_at', [$this->from_date, $this->to_date]);
            }, function ($query) {
                return $query;
        });

        $this->procurementRequestIds = $procurementRequests->pluck('id')->toArray();