app/Http/Livewire/Procurement/Requests/Supervisor/SupervisorRequestViewComponent.php

    public function forwardToSupervisor(ProcurementRequest $procurementRequest)
    {
        if ($procurementRequest->step_order==1) {

            $this->validate([
                'comment'=>'required|string',
            ]);

            DB::transaction(function () use($procurementRequest) {
                $nextStepOrder = $procurementRequest->step_order+1;

                $procurementRequest->update([
                    'status'=>ProcurementRequestEnum::PENDING,
                    'step_order'=>$nextStepOrder,
                ]);

                ProcurementRequestApproval::create([
                    'procurement_request_id' => $procurementRequest->id,
                    'approver_id' => auth()->user()->id,
                    'comment' => $this->comment,
                    'status' => ProcurementRequestEnum::SUBMITTED,
                    'step' => ProcurementRequestEnum::step($nextStepOrder-1),
                ]);

                ProcurementRequestApproval::create([
                    'procurement_request_id' => $procurementRequest->id,
                    'approver_id' => null,
                    'comment' => null,
                    'status' => ProcurementRequestEnum::PENDING,
                    'step' => ProcurementRequestEnum::step($nextStepOrder),
                ]);
            });
---
insert into `procurement_request_approvals` (`procurement_request_id`, `approver_id`, `comment`, `status`, `step`, `updated_at`, `created_at`) values (7, '', '', 'Pending', 'Finance', '2024-01-30 12:21:37', '2024-01-30 12:21:37')

    public function render()
    {
        $data['request'] = ProcurementRequest::with('items','documents','requester','approvals','approvals.approver','decisions','procurement_method','providers')->findOrFail($this->request_id);
---
select * from `procurement_requests` where `procurement_requests`.`id` = '7' limit 1
select `providers`.*, `selected_providers`.`procurement_request_id` as `pivot_procurement_request_id`, `selected_providers`.`provider_id` as `pivot_provider_id`, `selected_providers`.`is_best_bidder` as `pivot_is_best_bidder`, `selected_providers`.`invoice_no` as `pivot_invoice_no`, `selected_providers`.`invoice_date` as `pivot_invoice_date`, `selected_providers`.`payment_status` as `pivot_payment_status`, `selected_providers`.`date_paid` as `pivot_date_paid`, `selected_providers`.`quality_rating` as `pivot_quality_rating`, `selected_providers`.`timeliness_rating` as `pivot_timeliness_rating`, `selected_providers`.`cost_rating` as `pivot_cost_rating`, `selected_providers`.`average_rating` as `pivot_average_rating`, `selected_providers`.`contracts_manager_comment` as `pivot_contracts_manager_comment`, `selected_providers`.`created_by` as `pivot_created_by`, `selected_providers`.`created_at` as `pivot_created_at`, `selected_providers`.`updated_at` as `pivot_updated_at` from `providers` inner join `selected_providers` on `providers`.`id` = `selected_providers`.`provider_id` where `selected_providers`.`procurement_request_id` in (7)