app/Http/Livewire/Procurement/Requests/Supervisor/SupervisorRequestViewComponent.php

select * from `procurement_request_approvals` where (`procurement_request_id` = 7 and `step` = 'Supervisor') order by `created_at` desc limit 1
update `procurement_request_approvals` set `approver_id` = 1, `comment` = 'Currently, Ugandan healthcare data often resides in isolated systems, hindering collaboration and knowledge sharing. Data exchange relies on manual methods, prone to errors and delays, hampering clinical research efficiency and patient care. ', `status` = 'Approved', `procurement_request_approvals`.`updated_at` = '2024-01-30 12:21:37' where `id` = 25
---
    public function approveAndFowardRequest(ProcurementRequest $procurementRequest,$status)
    {
        $this->validate([
            'comment'=>'required|string',
        ]);

        if ($status==ProcurementRequestEnum::APPROVED) {
            $this->validate([
                'contracts_manager_id'=>'required|integer',
            ]);
        }

        DB::transaction(function () use($procurementRequest,$status) {
            $procurementRequestApproval=ProcurementRequestApproval::where(['procurement_request_id'=>$procurementRequest->id,'step'=>ProcurementRequestEnum::step($procurementRequest->step_order)])->latest()->first();

            if($procurementRequest->step_order < ProcurementRequestEnum::TOTAL_STEPS){
                $procurementRequestApproval->update([
                    'approver_id' => auth()->user()->id,
                    'comment' => $this->comment,
                    'status' => $status,
                ]);