app/Http/Livewire/Procurement/Requests/Supervisor/SupervisorPanelComponent.php

            function (Builder $query, string $type) {
                $column = $type === Department::class ? 'supervisor' : 'pi';

                $query->where($column, auth()->user()->employee->id);
---
select * from `employees` where `employees`.`id` = 1 limit 1