app/Http/Livewire/Procurement/Requests/Stores/Inc/ProcurementItemsReceptionComponent.php

    public function render()
    {
        $data['request'] = ProcurementRequest::with('items')->findOrFail($this->request_id);
---
select * from `procurement_requests` where `procurement_requests`.`id` = 7 limit 1