app/Services/Finance/Requests/FmsPaymentRequestService.php

            $paymentRequest->invoice_id = $requestData['invoice_id'] ?? null;
        }
        $paymentRequest->requestable()->associate($requestData['requestable']);
        $paymentRequest->save();
---
insert into `fms_payment_requests` (`request_code`, `request_description`, `request_type`, `total_amount`, `ledger_amount`, `budget_amount`, `amount_in_words`, `rate`, `currency_id`, `notice_text`, `department_id`, `project_id`, `budget_line_id`, `ledger_account`, `procurement_request_id`, `net_payment_terms`, `requestable_id`, `requestable_type`, `created_by`, `updated_at`, `created_at`) values ('PRETP1YERP', 'Payment Request For KAFULU GENERAL ENTERPRISES who is the approved provider for procurement request  with reference #24SUP-0028 and LPO Number #24-001, this is an advance payment before the suppliers starts processing this request', 'Procurement', 408, 0, 0, 'NA', 3730, 2, '', '', '', 6, 2, '7', 30, 3, 'App\Models\HumanResource\Settings\Department', 1, '2024-01-30 12:56:55', '2024-01-30 12:56:55')