app/Http/Livewire/Grants/GrantsComponent.php

select `projects`.*, DATEDIFF(end_date, CURRENT_DATE()) as days_to_expire from `projects` where `project_category` = 'Grant'
---
    public function filterProjects()
    {
        $projects = Project::search($this->search)->where('project_category','Grant')
        ->when($this->project_type != '', function ($query){
            $query->where('project_type',$this->project_type);
        })
        ->when($this->progress_status != '', function ($query){
            $query->where('progress_status',$this->progress_status);
        })
            ->when($this->from_date != '' && $this->to_date != '', function ($query) {
                $query->whereBetween('created_at', [$this->from_date, $this->to_date]);
            }, function ($query) {
                return $query;
            })
            ->addSelect([
                'projects.*',
                DB::raw('DATEDIFF(end_date, CURRENT_DATE()) as days_to_expire')
            ]);

        $this->projectIds = $projects->pluck('id')->toArray();