app/Http/Livewire/Finance/Requests/FmsPaymentRequestDetailsComponent.php

    public function render()
    {
        $data['request_data'] = $requestData = FmsPaymentRequest::where('request_code', $this->requestCode)->with(['department', 'project', 'toDepartment', 'toProject', 'currency', 'requestable', 'budgetLine','procurementRequest'])->first();
        if ($requestData) {
            if($requestData->status == 'Submitted' || $requestData->status =='Approved'|| $requestData->status =='Completed'){
               $this->redirectRequest($requestData->request_code);
            }
            $this->requestData = $requestData;
            $this->requestable_type = $requestData->requestable_type;
            $this->currency = $requestData->currency->code ?? 'UG';
            $data['items'] = FmsPaymentRequestDetail::where('request_id', $data['request_data']->id)->get();
            $data['attachments'] = FmsPaymentRequestAttachment::where('request_id', $data['request_data']->id)->get();
            $data['authorizations'] = FmsPaymentRequestAuthorization::where('request_id', $data['request_data']->id)->with(['authPosition', 'user', 'approver'])->get();
            // if ($requestData->request_type == 'Salary') {
                $data['req_employees'] = FmsRequestEmployee::where('request_id', $data['request_data']->id)->with('employee')->get();
                if ($requestData->requestable_type == 'App\Models\HumanResource\Settings\Department') {
                    $this->entry = 'Department';
                    $data['employees'] = Employee::where('department_id', $requestData->requestable_id)->get();
                    $data['signatories'] = User::where('is_active', 1)->where('employee_id', $requestData->requestable?->supervisor)->orWhere('employee_id', $requestData->requestable?->asst_supervisor)->get();
---
select * from `departments` where `departments`.`id` in (3)
select * from `fms_budget_lines` where `fms_budget_lines`.`id` in (6)
select * from `fms_currencies` where `fms_currencies`.`id` in (2)
select * from `fms_payment_requests` where `request_code` = 'PRETP1YERP' limit 1
select * from `fms_payment_request_details` where `request_id` = 25
select * from `fms_payment_request_attachments` where `request_id` = 25
select * from `fms_payment_request_authorizations` where `request_id` = 25
select * from `fms_request_employees` where `request_id` = 25
select * from `employees` where `department_id` = 3
select * from `users` where `is_active` = 1 and `employee_id` = 2 or `employee_id` = 1

            $data['employees'] = collect([]);
            $data['req_employees'] = collect([]);
        }
        $data['positions'] = FmsPaymentRequestPosition::where('name_lock', 'head')
            ->when($requestData?->requestable_type == 'App\Models\HumanResource\Settings\Department', function ($query) {
                $query->where('name_lock', '!=', 'grants');
            })->get();
        $level = FmsPaymentRequestAuthorization::where('request_id', $data['request_data']?->id)->orderBy('id', 'DESC')->first();
---
select * from `fms_payment_request_positions` where `name_lock` = 'head' and `name_lock` != 'grants'
select * from `fms_payment_request_authorizations` where `request_id` = 25 order by `id` desc limit 1